import telebot
from telebot.types import InlineKeyboardMarkup, InlineKeyboardButton

# Токен доступа телеграмм бота
API_TOKEN = '8282810230:AAGXROum1qTWgd_sEdRMVxgTLKNUbEE1VzY'
token_bot = telebot.TeleBot(API_TOKEN)

suits = ['♠️', '♥️', '♦️', '♣️']
deck_of_cards = ['6', '7', '8', '9', '10', 'J', 'Q', 'K', 'A']

@token_bot.message_handler(commands=['start'])
def send_welcome(message):
    user_info = message.from_user.full_name
    token_bot.send_message(message.chat.id, f'Добро пожаловать, {user_info}!\n'
                           f'Список игр:\n'
                           f'/21 - игра в 21🃏\n ')

"""
    r'/21\s+(\d+)$' - регулярное выражения (регулярка)
    \s+ - обозначает неограниченное количество пробелов;
    (\d+) - обрабатывает группу чисел;
    $ - конец строки.

    Регулярками в Python называются шаблоны, 
        которые используются для поиска соответствующего фрагмента текста 
        и сопоставления символов.

    По сути, наш шаблон - это набор символов,
     который проверяет строку на соответствие заданному правилу.
"""
# Обработчик для команды /21 с аргументом (например: /21 100)
@token_bot.message_handler(regexp=r'/21\s+(\d+)$')
def start_21_game(message):
    # Получаем ставку введенную пользователем
    bet = message.text.split()[1]

    markup = InlineKeyboardMarkup(row_width=1)
    button1 = InlineKeyboardButton(text='Запустить ✅', callback_data='...')
    button2 = InlineKeyboardButton(text='Отменить ❌', callback_data='...')
    markup.add(button1, button2)


    text = f'<b>🍀 21 · начни игру!</b>\n<code>·····················</code>\n<b>💸 Ставка:</b> {bet} p¢'

    token_bot.send_message(message.chat.id, text, reply_markup=markup, parse_mode='HTML')


@token_bot.message_handler(commands=['21'])
def game_21(message):
    rule_game = ('<blockquote>❗Цель игры - набрать 21 очко или ближе к этому числу, '
                 'чем дилер, не превышая лимит. Карты от 2 до 10 считаются по номиналу, '
                 'валет даёт 2 очка, дама - 3 очка, король - 4 очка, туз - 11 или 1, в зависимости от ситуации. '
                 'Игрок и дилер получают по две карты, после чего игрок может запрашивать '
                 'дополнительные карты или остановиться, стремясь улучшить свой счет. Дилер '
                 'обязан добирать карты, пока не достигнет 17 или более очков. Выигрывает тот, '
                 'чей итоговый счет ближе к 21, но перебор автоматически означает поражение.</blockquote>\n')

    name = message.from_user.first_name
    message_start = (f'👀{name}, чтобы начать игру, используй команду:\n\n♥<u><code>/21</code> <b>[ставка]</b></u>\nПример:<code> /21 100</code>\n'
                     f'Пример:<code> очко 100</code>')

    token_bot.send_message(message.chat.id, rule_game + message_start, parse_mode='HTML')




token_bot.infinity_polling()




